src/xml/001-02_1G_AirPrice_Rq.xml

<!--Release 8.0--><!--Version Dated as of 10/Dec/2014 11:53:33--><!--Air Pricing For Galileo(1G) with Minimum data Request--><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">   <soapenv:Header/>   <soapenv:Body>      <air:AirPriceReq xmlns:air="http://www.travelport.com/schema/air_v29_0" AuthorizedBy="user" TargetBranch="TRGT_BRCH" TraceId="trace">         <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v29_0" OriginApplication="UAPI"/>         <air:AirItinerary>            <air:AirSegment ArrivalTime="2014-11-30T07:35:00.000+11:00" AvailabilityDisplayType="Fare Shop/Optimal Shop" AvailabilitySource="S" Carrier="QF" ChangeOfPlane="false" ClassOfService="L" DepartureTime="2014-11-30T06:00:00.000+11:00" Destination="MEL" Distance="456" ETicketability="Yes" Equipment="737" FlightNumber="401" FlightTime="95" Group="0" Key="GDg5qyLlTImy7EDvYJVSHw==" LinkAvailability="true" OptionalServicesIndicator="false" Origin="SYD" ParticipantLevel="Secure Sell" PolledAvailabilityOption="Polled avail used" ProviderCode="1G"/>         </air:AirItinerary>         <air:AirPricingModifiers PlatingCarrier="QF"/>         <com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v29_0" BookingTravelerRef="gr8AVWGCR064r57Jt0+8bA==" Code="ADT"/>         <air:AirPricingCommand/>      </air:AirPriceReq>   </soapenv:Body>
</soapenv:Envelope>
